#pragma once



/********************************************/
//	タイトルシーン
/********************************************/
class sceneTitle : public BaseScene
{
public:
	//------------------------------------------------------
	//	初期化と開放
	//------------------------------------------------------
	bool Initialize();

	//------------------------------------------------------
	//	更新と描画
	//------------------------------------------------------
	bool Update();
	void Render();

private:
	//------------------------------------------------------
	//	画像ID
	//------------------------------------------------------
	enum IMAGE
	{
		LOGO,	// タイトルロゴ
		BACK1,
		BACK2,
		MAX
	};

	//------------------------------------------------------
	//	メンバ変数
	//------------------------------------------------------
	int m_moveX[2];									// 背景画像の移動	
	static bool m_bLoadSaveData;					// タイトル→モードセレクト移行の際、1度だけプレイヤーの情報を読み取るシーンに飛ばしたいために使う
	std::unique_ptr<tdn2DObj> m_pImages[IMAGE::MAX];// 画像
};
