#pragma once

/********************************************/
//	ローディングシーン
/********************************************/
class sceneLoading : public BaseScene
{
public:

	//------------------------------------------------------
	//	スレッド関係
	//------------------------------------------------------
	static void Thread_funk(void *arg);
	static bool isThread;


	//------------------------------------------------------
	//	初期化
	//------------------------------------------------------
	bool Initialize(BaseScene *newScene);

	//------------------------------------------------------
	//	更新・描画
	//------------------------------------------------------
	bool Update();
	void Render();

private:
	//------------------------------------------------------
	//	読み込むシーン
	//------------------------------------------------------
	BaseScene*	m_newScene;

	//------------------------------------------------------
	//	ロードの炎
	//------------------------------------------------------
	int	m_AnimeCount;
	int	m_AnimeFrame;
	std::unique_ptr<tdn2DObj>	m_pImage, m_pGauge;
	float m_fLoadGaugePercent;		// 描画用のpercentage(★補間で使う)
};
