#pragma once

//------------------------------------------------------
//	前方宣言
//------------------------------------------------------
class scenePlaying;
class NoteManager;
class UI;
class SoflanManager;
class Player;
class JudgeManager;
enum class GAUGE_OPTION;
class BeatBar;
class tdnMovie;
namespace scenePlayingState{ class Base; };

/********************************************/
//	演奏シーン
/********************************************/
class	scenePlaying : public BaseScene
{
private:
	//------------------------------------------------------
	//	ステートポインタ
	//------------------------------------------------------
	scenePlayingState::Base *m_pState;

public:
	//------------------------------------------------------
	//	デストラクタ
	//------------------------------------------------------
	~scenePlaying();

	//------------------------------------------------------
	//	初期化
	//------------------------------------------------------
	bool Initialize();
	
	//------------------------------------------------------
	//	更新・描画
	//------------------------------------------------------
	bool Update();
	void Render();

	//------------------------------------------------------
	//	ステート用の定数
	//------------------------------------------------------
	enum class SCENEPLAY_STATE
	{
		WAIT, PLAYING, END, FAILED, MAX
	};

	//------------------------------------------------------
	//	ステート変更
	//------------------------------------------------------
	void ChangeMode(SCENEPLAY_STATE state);

	//------------------------------------------------------
	//	音楽ゲーム部分を構成する各実体
	//------------------------------------------------------
	UI *m_pUI;
	SoflanManager *m_pSoflanMgr;
	NoteManager *m_pNoteMgr;
	JudgeManager *m_pJudgeMgr;
	Player *m_pPlayer;
	BeatBar *m_pBeatBar;


	//------------------------------------------------------
	//	バックムービー用
	//------------------------------------------------------
	tdnMovie *m_pMovie;
	tdn2DObj *m_pMovieImage;

	//------------------------------------------------------
	//	メンバ変数
	//------------------------------------------------------
	const char *m_pMusicName;	// 曲名
	GAUGE_OPTION m_GaugeOP;		// ゲージオプション(シングルトンで管理してるのだが、段位で使うことになったので、モジュール強度上げ)
	bool m_bPractice;			// 練習フラグ
	Surface *m_pBackUp;
};


